<?php

//陣列宣告方式

// $a=arry();
// $a=[1,2,3,4];
// $a=["小名","曉華","小強","阿國"];
// $a=[12=>"小名",23=>"曉華",30=>"小強",45=>"阿國"];
// $a=["小名"=>12,"曉華"=>23,"小強"=>30,"阿國"=>45];

// $a[]=12;
// $a[]=22;
// $a[]=333;
// $a[]=39;

// $a[22]="小名";
// $a[23]="曉華";
// $a[30]="小強";

$a["小名"]=22;
$a["曉華"]=23;
$a["小強"]=30;





echo"<pre>";print_r($a);"</pre>";
echo $a["小強"];


echo"<hr>";

//陣列維度
// $a=[[1,2.3],[4,5,6],[7,8,9]];
$a=[
    "小名"=>["國文"=>32,"英文"=>30],
    "曉華"=>["國文"=>40,"英文"=>60],
    "小強"=>["國文"=>62,"英文"=>80],
    "阿國"=>["國文"=>92,"英文"=>90],
];

echo"<pre>";print_r($a);"</pre>";

echo "<hr>";


//陣列函式
echo "count()=>";
echo count($a); //只會算第一層
echo "<hr>";
echo "is_array(\$a)=>";
echo is_array($a);
echo "<hr>";
echo "is_array(\$a)=>";
echo in_array(['國文'=>92,'英文'=>90],$a); 
echo '<hr>';
sort($a);
echo"<pre>";print_r($a);"</pre>";








?>